Repository: CoderBotOrg/backend
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr, it

source: Logic
fr: Logique
it: Logica

source: Loops
fr: Boucles
it: Cicli

source: Math
fr: Maths
it: Matematica

source: Text
fr: Texte
it: Testo

source: text
fr: texte
it: Testo

source: Lists
fr: Listes
it: Liste

source: list
fr: liste
it: lista

source: Variables
it: Variabili

source: Functions
fr: Fonctions
it: Funzioni

source: Event
it: Eventi

source: Movement
fr: Mouvements
it: Movimento

source: Sensor
fr: Détecteurs
it: Sensore

source: Sound
fr: Son
it: Suono

source: Control
fr: Contrôle
it: Controllo

source: Back
fr: Reculer
it: Indietro

source: Programming
fr: Programmation
it: Programmazione

source: Sounds
fr: Sons
it: Suoni

source: Start
fr: Démarrage
it: Avvio

source: Button
fr: Bouton
it: Bottone

source: User Interface
fr: Interface utilisateur
it: Interfaccia utente

source: Restart, Halt
fr: Arrêter, Redémarrer
it: Riavvia, Ferma

source: Movement assisted by vision
fr: Mouvement assisté par caméra
it: Movimento assistito da visione

source: Movement assisted by Gyroscope
fr: Mouvement assisté par Gyroscope
it: Movimento assistito dal Giroscopio

source: Step timing | distance / angle
fr: Pas de temps | distance / angle
it: Durata o lunghezza step (distanza / angolo)

source: Forward speed
fr: Vitesse d'avance
it: Avanti

source: Forward elapse / distance
fr: Temps / Distance d'avance
it: Durata / distanza avanti

source: Turn speed
fr: Vitesse de rotation
it: Velocità di rotazione

source: Turn elapse / angle
fr: Temps / Angle de rotation
it: Tempo / angolo di rotazione

source: Show control counter
fr: Afficher les compteurs
it: Mostra contatore mosse

source: HUD image name
fr: Nom de l'image
it: Nome immagine HUD

source: Editor level
fr: Niveau de l'éditeur
it: Livello editor

source: Move
fr: 2-3 ans
it: Movimento

source: Basic
fr: 3-6 ans
it: Base

source: Standard
fr: 6-10 ans
it: Normale

source: Advanced
fr: 8 ans et plus
it: Avanzato

source: Program editor details
fr: Options de l'éditeur
it: Dettagli editor del programma

source: Shows Editor scrollbars
fr: Afficher les ascenceurs
it: Mostra le scrollbar dell'area di lavoro

source: Save program before every run
fr: Enregistrer le programme avant chaque exécution
it: Salva il programma prima di ogni esecuzione

source: Other program parameters
fr: Autres paramètres de programmation
it: Altri parametri del programma

source: Auto record video on program run
fr: Enregistrer automatiquement une vidéo lorsque un programme est exécuté
it: Avvia automaticamente registrazione video all'avvio del programma

source: Max number of blocks allowed
fr: Nombre maximum de bloques autorisés
it: Numero massimo consentito di blocchi di programma

source: Start sound
fr: Son au démarrage
it: Suono avvio

source: Stop sound
fr: Son à l'arrêt
it: Suono stop

source: Shutter sound
fr: Son à la prise de photo
it: Suono avvio

source: Camera parameters
fr: Paramètres de la caméra
it: Parametri videocamera

source: Exposure mode
fr: Mode d'exposition
it: Esposizione

source: Camera refresh timeout
fr: Temps de rafraîchissement de la caméra
it: Intervallo di refresh immagine video

source: Camera jpeg quality
fr: La qualité de JPEG de la caméra
it: Indice qualità immagine jpeg

source: CV image resize factor (1/x)
fr: Facteur de redimensionnement d'image puor CV (1 / x)
it: Fattore di scala immagini per visione artificiale

source: Path object min size
fr: Taille objet min pour Chemin
it: Dimensione minima oggetto per funzione 'spazio davanti'

source: Path object max size
fr: Taille objet max pour Chemin
it: Dimensione massima oggetto per funzione 'spazio davanti'

source: Color object min size
fr: Taille objet min pour Couleur
it: Dimensione minima oggetto per funzione 'trova colore'

source: Color object max size
fr: Taille objet max pour Couleur
it: Dimensione massima oggetto per funzione 'trova colore'

source: Manage CNN Models
fr: Gérer les modèles cnn
it: Gestisci Modelli CNN

source: Default CNN Model
fr: Modèle cnn par défaut
it: Modello CNN di default

source: Motor control mode
fr: Mode de fonctionnement des moteurs
it: Tipo di motori (dc | servo)

source: Trim factor (1.0 = center)
fr: Facteur de correction (1.0 = centre)
it: Fattore di correzione velocità motori (1.0 = centrato)

source: Power (target angle -15)
fr: Puissance (pour un angle de -15)
it: Potenza (angolo target -15)

source: Power (target angle -4)
fr: Puissance (pour un angle de -4)
it: Potenza (angolo target -4)

source: Power (target angle -1)
fr: Puissance (pour un angle de -1)
it: Potenza (angolo target -1)

source: Load at start
fr: Charger le programme au démarrage
it: Carica all'avvio

source: Button function
fr: Fonction du bouton
it: Funzione del bottone

source: None
fr: Rien
it: Nessuno

source: Start/Stop current program
fr: Démarre/Arrête le programme en cours
it: Avvia/Ferma il programma caricato

source: Show Control page
fr: Afficher la page de contrôle
it: Mostra pagina Controllo

source: Show Control movement commands
fr: Afficher les commandes de déplacement sur la page de contrôle
it: Mostra comandi movimento in pagina Controllo

source: Show Program page
fr: Afficher la page de programmation
it: Nome programma

source: Show Preferences button
fr: Afficher le bouton 'Paramètres'
it: Mostra bottone Preferenze

source: WiFi Client access mode
fr: Mode d'accès du client Wifi
it: WiFi in modalità Client

source: Halt
fr: Arrêter
it: Stop

source: Restart
fr: Relancer
it: Riavvia

source: Update System
fr: Système de mise à jour
it: Aggiorna sistema

source: Cancel
fr: Annuler
it: Annulla

source: Save
fr: Enregistrer
it: Salva

source: WiFi Client mode access data
fr: Paramétrage de la connexion Wifi
it: Dati di accesso alla rete WiFi

source: WiFi mode
fr: Mode Wifi
it: Modalità WiFi

source: Access Point
it: Accesso Point

source: WiFi name
fr: Nom du réseau Wifi
it: Nome rete WiFi

source: WiFi password
fr: Mot de passe du réseau Wifi
it: Password WiFi

source: Apply Wifi config
fr: Appliquer
it: Applica le modifiche alla configurazione WiFi

source: WiFi AP mode access
fr: Mode Access Point
it: WiFi in modalità AP

source: Access Point mode is being set
fr: Le mode Point d'accès est en cours
it: Wifi configurato in modalità Access Point

source: Wait 30 seconds
fr: Attendez 30 secondes
it: Attendere 30 secondi

source: Connect your device to the "coderbot" named wifi
fr: Connectez votre appareil au "coderbot" nommé wifi
it: Connettere il dispositivo alla rete Wifi chiamata "coderbot"

source: Click on the following link
fr: Cliquez sur le lien suivant
it: Cliccare sul seguente link

source: WiFi Client mode access
fr: Mode Client
it: WiFi in modalità Client

source: Client mode is being set
fr: Le mode client est en cours de configuration
it: Wifi configurato in modalità Client

source: Connect your device to your own wifi (wifi network must be connected to internet)
fr: Connectez votre appareil à votre propre wifi (le réseau wifi doit être connecté à internet
it: Connettere il device alla propria rete wifi domestica (la rete deve essere connessa a internet)

source: System update
fr: Mise à jour du système
it: Aggiorna il sistema

source: Update log (it may require several minutes)
fr: Journal de mise à jour (il peut falloir plusieurs minutes)
it: Log degli aggiornamenti (potrebbe richiedere alcuni minuti)

source: Close
fr: Fermer
it: Chiudi

source: CNN Models
fr: Modèles CNN
it: Modelli CNN

source: Train new CNN Model
fr: Former le nouveau modèle CNN
it: Crea nuovo modello CNN?

source: Model name
fr: Nom du modèle
it: Nome modello

source: Image tags
it: Tag immagini

source: Model architecture
fr: ypes de modèles
it: Tipo modello

source: Training steps
fr: Etapes de la formation
it: Passi per l'allenamento

source: Learning rate
fr: Taux d'apprentissage
it: Progressione allenamento

source: Train new Model
fr: Former un nouveau modèle
it: Allena nuovo modello

source: Preferences
fr: Préférences
it: Preferenze

source: Program
fr: Programmation
it: Programma

source: Forward
fr: Avancer
it: Avanti

source: Left
fr: Gauche
it: Sinistra

source: Right
fr: Droite
it: Destra

source: Backward
fr: Reculer
it: Indietro

source: Say
fr: Parler
it: Parla

source: Photo
it: Foto

source: Rec
fr: Enregistrer
it: Registra

source: Stop
fr: Arrêter
it: Ferma

source: Photos
it: Album

source: Color at point:
fr: Couleur au point:
it: Colore del punto:

source: New
fr: Nouveau
it: Nuovo

source: Load
fr: Ouvrir
it: Carica

source: Run
fr: Exécuter
it: Esegui

source: Show last
fr: Montrer le dernier
it: Mostra ultimo

source: Save as
fr: Enregistrer sous...
it: Salva come

source: Show
fr: Montrer le code
it: Mostra codice

source: is running
fr: en cours d'exécution
it: in esecuzione

source: New Program
fr: Nouveau programme
it: Nuovo programma

source: Program name
fr: Nom du programme
it: Nome programma

source: Create
fr: Enregistrer
it: Crea

source: Save Program As
fr: Enregistrer le programme sous
it: Nuovo programma

source: Load Program
fr: Sélectionner le programme à ouvrir
it: Carica programma

source: Camera
fr: Caméra

source: Reboot
fr: Redémarrer
